### Работа с данными в Pandas

#### Задание 1

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].

Затем создайте датафрейм books cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],

['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники']

In [1]:
import pandas as pd

In [2]:
authors = pd.DataFrame({'author_id': [1, 2, 3],
                        'author_name': ['Тургенев', 'Чехов', 'Островский']}, columns=['author_id', 'author_name'])
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [3]:
books = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо','Толстый и тонкий',
                                    'Дама с собачкой', 'Гроза', 'Таланты и поклонники']}, 
                     columns=['author_id', 'book_title', 'price'])
books

   author_id            book_title price
0          1           Отцы и дети   NaN
1          1                 Рудин   NaN
2          1     Дворянское гнездо   NaN
3          2      Толстый и тонкий   NaN
4          2       Дама с собачкой   NaN
5          3                 Гроза   NaN
6          3  Таланты и поклонники   NaN

#### Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [4]:
authors_price = pd.merge(authors, books, on = 'author_id', how = 'inner')
authors_price

   author_id author_name            book_title price
0          1    Тургенев           Отцы и дети   NaN
1          1    Тургенев                 Рудин   NaN
2          1    Тургенев     Дворянское гнездо   NaN
3          2       Чехов      Толстый и тонкий   NaN
4          2       Чехов       Дама с собачкой   NaN
5          3  Островский                 Гроза   NaN
6          3  Островский  Таланты и поклонники   NaN

In [5]:
# Добавление значений в столбец price
authors_price['price'] = [100, 100, 200, 400, 100, 700, 1000]
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    100
1          1    Тургенев                 Рудин    100
2          1    Тургенев     Дворянское гнездо    200
3          2       Чехов      Толстый и тонкий    400
4          2       Чехов       Дама с собачкой    100
5          3  Островский                 Гроза    700
6          3  Островский  Таланты и поклонники   1000

#### Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [6]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name            book_title  price
6          3  Островский  Таланты и поклонники   1000
5          3  Островский                 Гроза    700
3          2       Чехов      Толстый и тонкий    400
2          1    Тургенев     Дворянское гнездо    200
0          1    Тургенев           Отцы и дети    100

#### Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [7]:
# 1 вариант
authors_stat = authors_price.groupby('author_name')['price'].agg(['min', 'max', 'mean'])
authors_stat.reset_index(inplace = True)
authors_stat

  author_name  min   max        mean
0  Островский  700  1000  850.000000
1    Тургенев  100   200  133.333333
2       Чехов  100   400  250.000000

In [8]:
# 2 вариант
authors_stat = pd.DataFrame({'author_name': authors_price['author_name'].unique(),
                             'min_price': [authors_price.loc[authors_price['author_id'] == 1, 'price'].min(),
                                           authors_price.loc[authors_price['author_id'] == 2, 'price'].min(),
                                           authors_price.loc[authors_price['author_id'] == 3, 'price'].min()],
                             'max_price': [authors_price.loc[authors_price['author_id'] == 1, 'price'].max(),
                                           authors_price.loc[authors_price['author_id'] == 2, 'price'].max(),
                                           authors_price.loc[authors_price['author_id'] == 3, 'price'].max()],
                             'mean_price': [authors_price.loc[authors_price['author_id'] == 1, 'price'].mean(),
                                           authors_price.loc[authors_price['author_id'] == 2, 'price'].mean(),
                                           (authors_price.loc[authors_price['author_id'] == 3, 'price'].mean())]})
authors_stat

# Уверена, что есть более компактный способ. Например, числа author_id, 
# прописанные вручную заменить на автоподстановку из таблицы authors_price. Затрудняюсь это сделать.

  author_name  min_price  max_price  mean_price
0    Тургенев        100        200  133.333333
1       Чехов        100        400  250.000000
2  Островский        700       1000  850.000000

#### Задание 5

Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].

Просмотрите документацию по функции pd.pivot table с помощью вопросительного знака.

Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.

Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [9]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    100  твердая
1          1    Тургенев                 Рудин    100   мягкая
2          1    Тургенев     Дворянское гнездо    200   мягкая
3          2       Чехов      Толстый и тонкий    400  твердая
4          2       Чехов       Дама с собачкой    100  твердая
5          3  Островский                 Гроза    700   мягкая
6          3  Островский  Таланты и поклонники   1000   мягкая

In [10]:
book_info = pd.pivot_table(authors_price, index='author_name', columns='cover',
                           values='price', aggfunc='sum').fillna(0)
book_info

cover        мягкая  твердая
author_name
Островский   1700.0      0.0
Тургенев      300.0    100.0
Чехов           0.0    500.0

In [11]:
book_info.to_pickle('book_info.pkl')

In [12]:
book_info2 = pd.read_pickle('book_info.pkl')
book_info2

cover        мягкая  твердая
author_name
Островский   1700.0      0.0
Тургенев      300.0    100.0
Чехов           0.0    500.0